# Задача 2: Найдите сумму цифр трехзначного числа.
# ___________________START
num = int(input('Введите число 3х значное: '))

a = num // 100


b = num % 100 // 10


c = num % 10

print(f"Сумма чисел {a} + {b} + {c} = {a + b + c}")
# ___________________END
